WSDL/OpenShipService/OpenShip_v15/RetrievePackageInOpenShipment.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v15="http://fedex.com/ws/openship/v15">
   <soapenv:Header/>
   <soapenv:Body>
      <v15:RetrievePackageInOpenShipmentRequest>
          <v15:WebAuthenticationDetail>
            <v15:CspCredential>
               <v15:Key>INPUT YOUR INFORMATION</v15:Key>
               <v15:Password>INPUT YOUR INFORMATION</v15:Password>
            </v15:CspCredential>
            <v15:UserCredential>
               <v15:Key>INPUT YOUR INFORMATION</v15:Key>
               <v15:Password>INPUT YOUR INFORMATION</v15:Password>
            </v15:UserCredential>
         </v15:WebAuthenticationDetail>
         <v15:ClientDetail>
            <v15:AccountNumber>INPUT YOUR INFORMATION</v15:AccountNumber>
            <v15:MeterNumber>INPUT YOUR INFORMATION</v15:MeterNumber>

            <v15:Localization>
               <v15:LanguageCode>EN</v15:LanguageCode>
               <v15:LocaleCode>en</v15:LocaleCode>
            </v15:Localization>
         </v15:ClientDetail>
         <v15:TransactionDetail>
            <v15:CustomerTransactionId>RetrievePackageInOpenShipmentRequest_v15</v15:CustomerTransactionId>
            <v15:Localization>
               <v15:LanguageCode>EN</v15:LanguageCode>
               <v15:LocaleCode>en</v15:LocaleCode>
            </v15:Localization>
         </v15:TransactionDetail>
         <v15:Version>
            <v15:ServiceId>ship</v15:ServiceId>
            <v15:Major>15</v15:Major>
            <v15:Intermediate>0</v15:Intermediate>
            <v15:Minor>0</v15:Minor>
         </v15:Version>
         <v15:Index>index3766</v15:Index>
         <v15:TrackingId>
            <v15:TrackingNumber>794890222871</v15:TrackingNumber>
         </v15:TrackingId>
      </v15:RetrievePackageInOpenShipmentRequest>
   </soapenv:Body>
</soapenv:Envelope>


Response:

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <RetrievePackageInOpenShipmentReply xmlns="http://fedex.com/ws/openship/v15">
         <HighestSeverity>SUCCESS</HighestSeverity>
         <Notifications>
            <Severity>SUCCESS</Severity>
            <Source>ship</Source>
            <Code>0000</Code>
            <Message>Success</Message>
            <LocalizedMessage>Success</LocalizedMessage>
         </Notifications>
         <TransactionDetail>
            <CustomerTransactionId>RetrievePackageInOpenShipmentRequest_v15</CustomerTransactionId>
            <Localization>
               <LanguageCode>EN</LanguageCode>
               <LocaleCode>en</LocaleCode>
            </Localization>
         </TransactionDetail>
         <Version>
            <ServiceId>ship</ServiceId>
            <Major>7</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <RequestedPackageLineItem>
            <SequenceNumber>1</SequenceNumber>
            <GroupNumber>0</GroupNumber>
            <GroupPackageCount>1</GroupPackageCount>
            <TrackingIds>
               <TrackingIdType>FEDEX</TrackingIdType>
               <FormId>0430</FormId>
               <TrackingNumber>794890222871</TrackingNumber>
            </TrackingIds>
            <Weight>
               <Units>LB</Units>
               <Value>50.0</Value>
            </Weight>
            <Dimensions>
               <Length>11</Length>
               <Width>11</Width>
               <Height>11</Height>
               <Units>IN</Units>
            </Dimensions>
            <PhysicalPackaging>BAG</PhysicalPackaging>
            <ItemDescription>BAG</ItemDescription>
            <ContentRecords>
               <PartNumber>1</PartNumber>
               <ItemNumber>1</ItemNumber>
               <ReceivedQuantity>1</ReceivedQuantity>
               <Description>BAG</Description>
            </ContentRecords>
         </RequestedPackageLineItem>
      </RetrievePackageInOpenShipmentReply>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


Additional Info:
URL:https://wsdrt.idev.fedex.com:443/web-services
Date:Fri Dec 16 12:24:14 IST 2016
TimeTaken:2282ms
